Sysbench_PolarDB_Mysql5.7-8.0/Sysbench_Mysql8.0_log/Mysql8.0-8Core64GB-1Node/202103102008/sysbench_read_write_4500.log
Time: 20210310203329, now running sysbench with thread of:  + 4500
Running command: sysbench /usr/share/sysbench/oltp_read_write.lua --db-driver=mysql --mysql-host=pc-0iw9geske305hs2s8.rwlb.japan.rds.aliyuncs.com --mysql-port=3306 --mysql-user=sbtest --mysql-password=Test1234 --mysql-db=sbtest --table-size=100000000 --tables=500 --events=0 --time=60 --db-ps-mode=disable --percentile=95 --report-interval=1 --threads=4500 run
sysbench 1.0.18-ab7d582 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4500
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 4500 tps: 939.11 qps: 64223.30 (r/w/o: 53115.55/5197.44/5910.31) lat (ms,95%): 1032.01 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 4500 tps: 1095.19 qps: 32822.71 (r/w/o: 23835.93/6788.39/2198.39) lat (ms,95%): 2009.23 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 4500 tps: 1385.01 qps: 22464.12 (r/w/o: 13710.07/5994.03/2760.01) lat (ms,95%): 2985.89 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 4500 tps: 1453.92 qps: 26803.47 (r/w/o: 18265.96/5618.68/2918.83) lat (ms,95%): 3911.79 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 4500 tps: 1432.11 qps: 29011.25 (r/w/o: 20432.58/5716.44/2862.22) lat (ms,95%): 4855.31 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 4500 tps: 1651.96 qps: 32682.28 (r/w/o: 23010.49/6365.86/3305.93) lat (ms,95%): 5607.61 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 4500 tps: 1758.91 qps: 35748.21 (r/w/o: 25273.74/6959.65/3514.82) lat (ms,95%): 6026.41 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 4500 tps: 1709.05 qps: 36872.08 (r/w/o: 26258.77/7189.21/3424.10) lat (ms,95%): 5409.26 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 4500 tps: 1814.97 qps: 35281.51 (r/w/o: 24354.66/7299.90/3626.95) lat (ms,95%): 5813.24 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4500 tps: 1800.68 qps: 34931.78 (r/w/o: 24466.64/6860.78/3604.36) lat (ms,95%): 5033.35 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 4500 tps: 1868.22 qps: 38395.58 (r/w/o: 27224.25/7438.89/3732.45) lat (ms,95%): 4943.53 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 4500 tps: 1709.29 qps: 34326.42 (r/w/o: 24198.33/6704.53/3423.57) lat (ms,95%): 4517.90 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 4500 tps: 1927.56 qps: 38732.66 (r/w/o: 27232.51/7652.06/3848.09) lat (ms,95%): 4055.23 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 4500 tps: 1870.83 qps: 37462.64 (r/w/o: 26360.63/7358.34/3743.66) lat (ms,95%): 4437.27 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4500 tps: 1704.91 qps: 35443.10 (r/w/o: 25223.65/6808.63/3410.82) lat (ms,95%): 6360.91 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 4500 tps: 1883.13 qps: 36808.08 (r/w/o: 25663.21/7375.61/3769.27) lat (ms,95%): 4203.93 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 4500 tps: 1659.88 qps: 35540.79 (r/w/o: 25576.52/6647.52/3316.75) lat (ms,95%): 4280.32 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 4500 tps: 1873.02 qps: 38774.34 (r/w/o: 27469.24/7558.07/3747.03) lat (ms,95%): 3773.42 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 4500 tps: 1767.88 qps: 34456.60 (r/w/o: 23875.34/7046.51/3534.75) lat (ms,95%): 3982.86 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4500 tps: 2246.28 qps: 43800.48 (r/w/o: 30307.79/9000.13/4492.56) lat (ms,95%): 12838.21 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 4500 tps: 2103.84 qps: 41838.74 (r/w/o: 28964.74/8667.32/4206.67) lat (ms,95%): 4280.32 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 4500 tps: 1869.98 qps: 37546.52 (r/w/o: 26538.66/7266.91/3740.95) lat (ms,95%): 2828.87 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 4500 tps: 2059.06 qps: 39253.10 (r/w/o: 27024.76/8111.23/4117.12) lat (ms,95%): 8184.67 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 4500 tps: 1519.98 qps: 31602.55 (r/w/o: 22111.68/6449.91/3040.96) lat (ms,95%): 8184.67 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4500 tps: 1832.96 qps: 39782.17 (r/w/o: 28259.41/7859.84/3662.92) lat (ms,95%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 4500 tps: 2190.06 qps: 43015.16 (r/w/o: 30059.81/8572.23/4383.12) lat (ms,95%): 3208.88 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 4500 tps: 1694.98 qps: 32859.58 (r/w/o: 23014.71/6454.92/3389.96) lat (ms,95%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 4500 tps: 1514.02 qps: 33535.46 (r/w/o: 24152.33/6359.09/3024.04) lat (ms,95%): 3706.08 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 4500 tps: 1421.04 qps: 26457.71 (r/w/o: 18217.49/5395.15/2845.08) lat (ms,95%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4500 tps: 1573.99 qps: 31050.71 (r/w/o: 21731.80/6169.94/3148.97) lat (ms,95%): 4055.23 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 4500 tps: 1656.17 qps: 35668.60 (r/w/o: 25655.59/6703.68/3309.33) lat (ms,95%): 3208.88 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 4500 tps: 1710.73 qps: 32807.80 (r/w/o: 22833.38/6550.96/3423.46) lat (ms,95%): 4128.91 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 4500 tps: 1793.00 qps: 38427.91 (r/w/o: 27569.94/7271.98/3585.99) lat (ms,95%): 2778.39 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 4500 tps: 1732.13 qps: 34418.67 (r/w/o: 24251.88/6702.52/3464.27) lat (ms,95%): 2405.65 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4500 tps: 1819.09 qps: 37832.85 (r/w/o: 26883.32/7311.36/3638.18) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 4500 tps: 1830.92 qps: 37445.38 (r/w/o: 26625.85/7156.69/3662.84) lat (ms,95%): 1836.24 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 4500 tps: 1842.88 qps: 37068.54 (r/w/o: 25990.28/7392.51/3685.76) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 4500 tps: 422.64 qps: 6858.58 (r/w/o: 4687.70/1532.71/638.16) lat (ms,95%): 32745.49 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 4500 tps: 2462.75 qps: 57462.70 (r/w/o: 21396.93/29407.90/6657.86) lat (ms,95%): 34563.04 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4500 tps: 3702.22 qps: 28423.66 (r/w/o: 13149.77/7874.46/7399.43) lat (ms,95%): 27349.55 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 4500 tps: 173.01 qps: 32120.30 (r/w/o: 30721.25/1048.04/351.01) lat (ms,95%): 4055.23 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 4500 tps: 1000.88 qps: 32234.11 (r/w/o: 23587.15/6646.20/2000.76) lat (ms,95%): 2778.39 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 4500 tps: 1104.03 qps: 20666.53 (r/w/o: 13556.35/4902.13/2208.06) lat (ms,95%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 4500 tps: 1217.99 qps: 21643.91 (r/w/o: 14320.94/4885.98/2436.99) lat (ms,95%): 4599.99 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4500 tps: 1067.99 qps: 20076.74 (r/w/o: 13763.83/4180.95/2131.97) lat (ms,95%): 5409.26 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 4500 tps: 955.00 qps: 18281.92 (r/w/o: 12771.94/3595.98/1913.99) lat (ms,95%): 6360.91 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 4500 tps: 961.87 qps: 19714.31 (r/w/o: 13797.12/3993.46/1923.74) lat (ms,95%): 7346.49 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 4500 tps: 1012.06 qps: 20307.18 (r/w/o: 14294.83/3989.23/2023.12) lat (ms,95%): 8184.67 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 4500 tps: 1039.92 qps: 20831.30 (r/w/o: 14750.80/3999.67/2080.83) lat (ms,95%): 8795.93 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4500 tps: 773.02 qps: 15595.43 (r/w/o: 10978.30/3071.08/1546.04) lat (ms,95%): 9977.52 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 4500 tps: 878.03 qps: 18078.54 (r/w/o: 12878.39/3444.10/1756.05) lat (ms,95%): 10722.67 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 4500 tps: 1020.99 qps: 20849.88 (r/w/o: 14681.92/4126.98/2040.99) lat (ms,95%): 11732.86 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 4500 tps: 1198.09 qps: 25318.87 (r/w/o: 18067.33/4854.36/2397.18) lat (ms,95%): 11732.86 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 4500 tps: 1395.99 qps: 28794.81 (r/w/o: 20382.87/5620.96/2790.98) lat (ms,95%): 10158.80 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4500 tps: 1079.86 qps: 19939.46 (r/w/o: 13624.26/4154.47/2160.72) lat (ms,95%): 14562.82 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 4500 tps: 989.98 qps: 20091.52 (r/w/o: 14196.66/3915.91/1978.95) lat (ms,95%): 10343.39 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 4500 tps: 961.12 qps: 19010.42 (r/w/o: 13357.70/3729.48/1923.25) lat (ms,95%): 9977.52 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 4500 tps: 898.01 qps: 17901.17 (r/w/o: 12676.12/3429.03/1796.02) lat (ms,95%): 9284.15 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 4500 tps: 968.92 qps: 19794.26 (r/w/o: 14035.77/3823.66/1934.83) lat (ms,95%): 10722.67 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4500 tps: 1413.16 qps: 28756.30 (r/w/o: 20451.35/5475.63/2829.32) lat (ms,95%): 10531.32 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 4500 tps: 1361.89 qps: 28598.70 (r/w/o: 20295.37/5579.55/2723.78) lat (ms,95%): 8795.93 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 4500 tps: 1313.96 qps: 27041.26 (r/w/o: 19142.48/5270.86/2627.93) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 4500 tps: 1218.11 qps: 24295.19 (r/w/o: 17209.55/4650.42/2435.22) lat (ms,95%): 7615.89 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 4500 tps: 1518.04 qps: 30319.81 (r/w/o: 21461.58/5821.16/3037.08) lat (ms,95%): 7086.63 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 4500 tps: 1918.19 qps: 39899.85 (r/w/o: 28271.73/7791.75/3836.37) lat (ms,95%): 5312.73 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 4500 tps: 1565.97 qps: 31919.34 (r/w/o: 22722.53/6064.87/3131.93) lat (ms,95%): 4437.27 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 4500 tps: 1632.96 qps: 33376.21 (r/w/o: 23768.44/6343.85/3263.92) lat (ms,95%): 3841.98 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 4500 tps: 1831.07 qps: 37883.54 (r/w/o: 26900.09/7319.30/3664.15) lat (ms,95%): 3040.14 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 4500 tps: 2012.93 qps: 40938.57 (r/w/o: 29022.98/7889.72/4025.86) lat (ms,95%): 2449.36 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4500 tps: 2063.97 qps: 42251.33 (r/w/o: 29995.52/8130.87/4124.93) lat (ms,95%): 1803.47 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 4500 tps: 1866.01 qps: 38835.14 (r/w/o: 27051.10/8050.03/3734.01) lat (ms,95%): 2585.31 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 4500 tps: 1490.84 qps: 30329.74 (r/w/o: 21451.69/5896.37/2981.68) lat (ms,95%): 1258.08 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 4500 tps: 1672.16 qps: 34443.23 (r/w/o: 24436.29/6661.63/3345.31) lat (ms,95%): 995.51 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 4500 tps: 1547.08 qps: 29782.54 (r/w/o: 18704.97/7983.41/3094.16) lat (ms,95%): 29926.15 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 4500 tps: 1261.92 qps: 27385.31 (r/w/o: 19245.82/5615.65/2523.84) lat (ms,95%): 5813.24 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 4500 tps: 1920.96 qps: 29200.33 (r/w/o: 17669.59/7689.82/3840.91) lat (ms,95%): 33340.46 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 4500 tps: 714.01 qps: 15449.13 (r/w/o: 11004.10/3016.03/1429.01) lat (ms,95%): 20503.50 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 4500 tps: 777.10 qps: 16888.19 (r/w/o: 12244.59/3090.40/1553.20) lat (ms,95%): 17752.80 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 4500 tps: 1376.88 qps: 28731.53 (r/w/o: 20285.25/5691.51/2754.76) lat (ms,95%): 3773.42 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4500 tps: 1582.95 qps: 32217.97 (r/w/o: 22600.28/6453.79/3163.90) lat (ms,95%): 3841.98 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 4500 tps: 1773.95 qps: 35913.98 (r/w/o: 25193.29/7170.80/3549.90) lat (ms,95%): 4437.27 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 4500 tps: 1804.11 qps: 36188.20 (r/w/o: 25557.55/7022.43/3608.22) lat (ms,95%): 4517.90 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 4500 tps: 1477.93 qps: 30620.46 (r/w/o: 21816.90/5847.71/2955.85) lat (ms,95%): 2985.89 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 4500 tps: 1694.02 qps: 33901.43 (r/w/o: 23900.31/6613.08/3388.04) lat (ms,95%): 2985.89 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 4500 tps: 1870.94 qps: 38063.69 (r/w/o: 26924.07/7397.74/3741.87) lat (ms,95%): 2778.39 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 4500 tps: 1831.06 qps: 37121.29 (r/w/o: 26153.91/7307.25/3660.13) lat (ms,95%): 2238.47 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 4500 tps: 1551.92 qps: 30357.46 (r/w/o: 21200.92/6051.69/3104.84) lat (ms,95%): 18738.17 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 4500 tps: 1775.07 qps: 36336.47 (r/w/o: 25755.04/7030.28/3551.14) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 4500 tps: 2026.95 qps: 40959.98 (r/w/o: 28832.28/8074.80/4052.90) lat (ms,95%): 1869.60 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4500 tps: 2144.08 qps: 42998.64 (r/w/o: 30124.15/8586.33/4288.16) lat (ms,95%): 2493.86 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 4500 tps: 1743.99 qps: 26271.82 (r/w/o: 16310.89/6796.95/3163.98) lat (ms,95%): 43679.10 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 4500 tps: 1095.07 qps: 25567.63 (r/w/o: 18322.17/4730.30/2515.16) lat (ms,95%): 26861.48 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 4500 tps: 2071.87 qps: 41554.45 (r/w/o: 28898.22/8514.48/4141.75) lat (ms,95%): 2932.60 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 4500 tps: 1928.88 qps: 40934.44 (r/w/o: 29068.18/8006.50/3859.76) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 4500 tps: 1625.17 qps: 31846.39 (r/w/o: 22297.37/6299.67/3249.35) lat (ms,95%): 2159.29 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 4500 tps: 1804.86 qps: 35974.23 (r/w/o: 25407.04/6957.46/3609.72) lat (ms,95%): 2539.17 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 4500 tps: 1572.03 qps: 32003.54 (r/w/o: 22592.38/6267.11/3144.05) lat (ms,95%): 2728.81 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 4500 tps: 1678.10 qps: 34443.15 (r/w/o: 24343.52/6742.42/3357.21) lat (ms,95%): 2728.81 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 4500 tps: 1849.33 qps: 37364.98 (r/w/o: 26375.87/7290.46/3698.65) lat (ms,95%): 2362.72 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 4500 tps: 635.92 qps: 12720.26 (r/w/o: 8960.87/2490.22/1269.17) lat (ms,95%): 35191.04 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 4500 tps: 2939.47 qps: 34903.94 (r/w/o: 14586.05/14969.06/5348.84) lat (ms,95%): 55199.54 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 4500 tps: 2217.88 qps: 29982.31 (r/w/o: 22737.72/2402.86/4841.73) lat (ms,95%): 42134.07 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 4500 tps: 960.97 qps: 43185.64 (r/w/o: 35560.88/5702.82/1921.94) lat (ms,95%): 3841.98 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 4500 tps: 929.99 qps: 24917.65 (r/w/o: 16611.77/6445.91/1859.97) lat (ms,95%): 3511.19 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 4500 tps: 1813.00 qps: 28708.05 (r/w/o: 18089.03/6994.01/3625.01) lat (ms,95%): 4280.32 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 4500 tps: 1767.07 qps: 34559.35 (r/w/o: 24470.96/6553.26/3535.14) lat (ms,95%): 5033.35 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 4500 tps: 1719.00 qps: 36935.92 (r/w/o: 26736.94/6760.98/3437.99) lat (ms,95%): 5409.26 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 4500 tps: 2282.22 qps: 48349.64 (r/w/o: 34813.34/8972.86/4563.44) lat (ms,95%): 4358.09 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4500 tps: 2122.75 qps: 40532.31 (r/w/o: 27689.80/8598.01/4244.51) lat (ms,95%): 6960.17 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 4500 tps: 1779.96 qps: 32866.17 (r/w/o: 22814.43/6489.84/3561.91) lat (ms,95%): 6713.97 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 4500 tps: 1470.03 qps: 29496.67 (r/w/o: 20391.46/6166.14/2939.07) lat (ms,95%): 4358.09 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 4500 tps: 1577.15 qps: 36862.47 (r/w/o: 26949.54/6757.64/3155.30) lat (ms,95%): 3841.98 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 4500 tps: 1772.87 qps: 32119.68 (r/w/o: 21727.43/6846.51/3545.74) lat (ms,95%): 7754.26 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 4500 tps: 1864.01 qps: 39902.27 (r/w/o: 28699.19/7477.05/3726.03) lat (ms,95%): 5312.73 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 4500 tps: 1974.06 qps: 39344.10 (r/w/o: 27462.77/7932.22/3949.11) lat (ms,95%): 3639.94 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 4500 tps: 2238.07 qps: 43510.30 (r/w/o: 30420.91/8612.26/4477.13) lat (ms,95%): 3151.62 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 4500 tps: 2278.89 qps: 48189.62 (r/w/o: 34556.29/9076.55/4556.77) lat (ms,95%): 2778.39 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 4500 tps: 2093.09 qps: 41306.70 (r/w/o: 29072.20/8049.33/4185.17) lat (ms,95%): 2493.86 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4500 tps: 2234.62 qps: 43288.36 (r/w/o: 30167.83/8926.50/4194.02) lat (ms,95%): 11732.86 err/s: 0.00 reconn/s: 0.00
[ 121s ] thds: 4500 tps: 3274.18 qps: 19025.75 (r/w/o: 5078.14/10660.39/3287.21) lat (ms,95%): 16519.10 err/s: 0.00 reconn/s: 0.00
[ 122s ] thds: 4500 tps: 105.00 qps: 651.98 (r/w/o: 206.99/339.99/105.00) lat (ms,95%): 15934.78 err/s: 0.00 reconn/s: 0.00
[ 123s ] thds: 4500 tps: 166.05 qps: 995.30 (r/w/o: 288.09/545.16/162.05) lat (ms,95%): 17435.99 err/s: 0.00 reconn/s: 0.00
[ 124s ] thds: 4500 tps: 115.99 qps: 661.93 (r/w/o: 170.98/374.96/115.99) lat (ms,95%): 18403.78 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 4500 tps: 73.01 qps: 363.03 (r/w/o: 71.01/224.02/68.01) lat (ms,95%): 18738.17 err/s: 0.00 reconn/s: 0.00
[ 126s ] thds: 4500 tps: 35.00 qps: 149.00 (r/w/o: 4.00/111.00/34.00) lat (ms,95%): 19425.29 err/s: 0.00 reconn/s: 0.00
[ 127s ] thds: 4500 tps: 6.00 qps: 26.00 (r/w/o: 2.00/18.00/6.00) lat (ms,95%): 20876.04 err/s: 0.00 reconn/s: 0.00
[ 128s ] thds: 4500 tps: 2.00 qps: 3.00 (r/w/o: 0.00/2.00/1.00) lat (ms,95%): 19425.29 err/s: 0.00 reconn/s: 0.00
[ 129s ] thds: 4500 tps: 17.00 qps: 63.01 (r/w/o: 0.00/47.00/16.00) lat (ms,95%): 20876.04 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 4500 tps: 81.02 qps: 547.13 (r/w/o: 187.05/279.07/81.02) lat (ms,95%): 22034.77 err/s: 0.00 reconn/s: 0.00
[ 131s ] thds: 4500 tps: 196.00 qps: 1120.02 (r/w/o: 299.01/626.01/195.00) lat (ms,95%): 22435.13 err/s: 0.00 reconn/s: 0.00
[ 132s ] thds: 4491 tps: 129.00 qps: 647.02 (r/w/o: 126.00/392.01/129.00) lat (ms,95%): 22842.77 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2713942
        write:                           775412
        other:                           387706
        total:                           3877060
    transactions:                        193853 (1462.50 per sec.)
    queries:                             3877060 (29249.98 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          132.5470s
    total number of events:              193853

Latency (ms):
         min:                                   10.47
         avg:                                 2827.30
         max:                                62931.38
         95th percentile:                    11317.84
         sum:                            548081066.77

Threads fairness:
    events (avg/stddev):           43.0784/14.92
    execution time (avg/stddev):   121.7958/3.16